![Data base](https://usa.bootcampcdn.com/wp-content/uploads/sites/106/2020/03/SQL-Coding-Class-San-Francisco-1-1.jpeg)

**Data Base**

**What is Database?**

Database is a collection of interrelated data.

**What is DBMS?**

DBMS (Database Management System) is software used to create, manage, and organize
databases.

**What is RDBMS?**

- RDBMS (Relational Database Management System) - is a DBMS based on the
concept of tables (also called relations).

- Data is organized into tables (also known as relations) with rows (records) and
columns (attributes).

- Eg - MySQL, PostgreSQL, Oracle etc.

**Database Tables**

A database most often contains one or more tables. Each table is identified by a name (e.g. "Customers"
or "Orders"). Tables contain records (rows) with data.

Below is an example of a table called "Persons":


| P_Id | LastName | FirstName | Address|  City| 
| :- | :- | :- | :- | :- |
| 1 | Hansen | Ola | Timoteivn 10 | Sandnes| 
| 2 |  Svendson | Tove | Borgvn 23 | Sandnes| 
| 3 | Pettersen |  Kari | Storgt 20 | Stavanger| 

**What is SQL?**

SQL is Structured Query Language - used to store, manipulate and retrieve data from
RDBMS.

(It is not a database, it is a language used to interact with database)

**We use SQL for CRUD Operations:**

**● CREATE** - To create databases, tables, insert tuples in tables etc

   **● READ** - To read data present in the database.

**● UPDATE** - Modify already inserted data.

**● DELETE** - Delete database, table or specific data point/tuple/row or multiple rows.

>*Note - SQL keywords are NOT case sensitive. Eg: select is the same as SELECT in SQL.

**What is the difference between SQL and MySQL?**

SQL is a standard language for retrieving and manipulating structured databases. On the contrary, MySQL is a relational database 
management system, like SQL Server, Oracle or IBM DB2, that is used to manage SQL databases.

**SQL Data Types**

In SQL, data types define the kind of data that can be stored in a column or variable.

*Here are the frequently used SQL data types:*

| DATATYPE|  DESCRIPTION | USAGE |
| :- | :- | :- | 
| CHAR|  string(0-255), can store characters of fixed length | CHAR(50) |
| VARCHAR | string(0-255), can store characters up to given length | VARCHAR(50)|
| BLOB |  string(0-65535), can store binary large object | BLOB(1000) |
| INT |  integer( -2,147,483,648 to 2,147,483,647 )| INT |
| TINYINT |  integer(-128 to 127)|  TINYINT
| BIGINT | integer( -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807 ) | BIGINT |
| BIT |  can store x-bit values. x can range from 1 to 64 | BIT(2) |
| FLOAT |  Decimal number - with precision to 23|  digits | FLOAT |
| DOUBLE |  Decimal number - with 24 to 53 digits | DOUBLE |
| BOOLEAN |  Boolean values 0 or 1 | BOOLEAN |
| DATE |  date in format of YYYY-MM-DD ranging from 1000-01-01 to 9999-12-31 | DATE |
| TIME |  HH:MM:SS | TIME |
| YEAR |  year in 4 digits format ranging from 1901 to 2155 | YEAR |

*Note - CHAR is for fixed length & VARCHAR is for variable length strings. Generally,
VARCHAR is better as it only occupies necessary memory & works more efficiently.

We can also use UNSIGNED with datatypes when we only have positive values to add.
Eg - UNSIGNED INT

1. DQL (Data Query Language) : Used to retrieve data from databases. (SELECT)
2. DDL (Data Definition Language) : Used to create, alter, and delete database objects
like tables, indexes, etc. (CREATE, DROP, ALTER, RENAME, TRUNCATE)
3. DML (Data Manipulation Language): Used to modify the database. (INSERT,
UPDATE, DELETE)
4. DCL (Data Control Language): Used to grant & revoke permissions. (GRANT,
REVOKE)
5. TCL (Transaction Control Language): Used to manage transactions. (COMMIT,
ROLLBACK, START TRANSACTIONS, SAVEPOINT)

**1. Data Definition Language (DDL)**

Data Definition Language (DDL) is a subset of SQL (Structured Query Language)
responsible for defining and managing the structure of databases and their objects.
    
DDL commands enable you to create, modify, and delete database objects like tables,
indexes, constraints, and more.

*Key DDL Commands are:*

- CREATE TABLE:

○ Used to create a new table in the database.

○ Specifies the table name, column names, data types, constraints, and more.

○ Example:
CREATE TABLE employees (id INT PRIMARY KEY, name VARCHAR(50),
salary DECIMAL(10, 2));

- ALTER TABLE:

○ Used to modify the structure of an existing table.

○ You can add, modify, or drop columns, constraints, and more.

○ Example: ALTER TABLE employees ADD COLUMN email VARCHAR(100)

- DROP TABLE:

○ Used to delete an existing table along with its data and structure.

○ Example: DROP TABLE employees;

- CREATE INDEX:

○ Used to create an index on one or more columns in a table.
    
○ Improves query performance by enabling faster data retrieval.
    
○ Example: CREATE INDEX idx_employee_name ON employees (name);

- DROP INDEX:

○ Used to remove an existing index from a table.

○ Example: DROP INDEX idx_employee_name;

- CREATE CONSTRAINT:

○ Used to define constraints that ensure data integrity.
    
○ Constraints include PRIMARY KEY, FOREIGN KEY, UNIQUE, NOT NULL,
and CHECK.

○ Example: ALTER TABLE orders ADD CONSTRAINT fk_customer FOREIGN
KEY (customer_id) REFERENCES customers(id);

- DROP CONSTRAINT:

○ Used to remove an existing constraint from a table.

○ Example: ALTER TABLE orders DROP CONSTRAINT fk_customer

- TRUNCATE TABLE:

○ Used to delete the data inside a table, but not the table itself.
    
○ Syntax – TRUNCATE TABLE table_name

**2. DATA QUERY/RETRIEVAL LANGUAGE (DQL or DRL)**

DQL (Data Query Language) is a subset of SQL focused on retrieving data from databases.

The SELECT statement is the foundation of DQL and allows us to extract specific columns
from a table.

- SELECT:

The SELECT statement is used to select data from a database

**The SQL SELECT Statement**

The SELECT statement is used to select data from a database.

The result is stored in a result table, called the result-set.

SQL SELECT Syntax

```sql
SELECT column_name(s)
FROM table_name
```
And
```sql
SELECT * FROM table_name
```
Note: SQL is not case sensitive. SELECT is the same as select.

An SQL SELECT Example

The "Persons" table:

| P_Id | LastName | FirstName | Address|  City| 
| :- | :- | :- | :- | :- |
| 1 | Hansen | Ola | Timoteivn 10 | Sandnes| 
| 2 |  Svendson | Tove | Borgvn 23 | Sandnes| 
| 3 | Pettersen |  Kari | Storgt 20 | Stavanger|

Now we want to select the content of the columns named "LastName" and "FirstName" from the table
above.

We use the following SELECT statement:

```sql
SELECT LastName,FirstName FROM Persons
```

The result-set will look like this:

|LastName| FirstName|
| :- | :- |
| Hansen | Ola |
| Svendson | Tove |
| Pettersen | Kari|

**The WHERE Clause**

 - The WHERE clause is used to filter records.
 
-  The WHERE clause is used to extract only those records that fulfill a specified criterion.
 
- SQL WHERE Syntax

```sql
SELECT column_name(s)
FROM table_name
WHERE column_name operator value
```

WHERE Clause Example

The "Persons" table:

| P_Id | LastName | FirstName | Address|  City| 
| :- | :- | :- | :- | :- |
| 1 | Hansen | Ola | Timoteivn 10 | Sandnes| 
| 2 |  Svendson | Tove | Borgvn 23 | Sandnes| 
| 3 | Pettersen |  Kari | Storgt 20 | Stavanger|

Now we want to select only the persons living in the city "Sandnes" from the table above.
We use the following SELECT statement:

```sql
SELECT * FROM Persons
WHERE City='Sandnes'
```

The result-set will look like this:

| P_Id | LastName | FirstName | Address | City |
| :- | :- | :- | :- | :- |
| 1 | Hansen | Ola | Timoteivn 10 | Sandnes |
| 2 | Svendson | Tove | Borgvn 23| Sandne s|

**Operators Allowed in the WHERE Clause**

With the WHERE clause, the following operators can be used:

| Operator|  Description| 
| :- | :- |     
| = |  Equal | 
| <>  |  Not equal | 
| > |  Greater than | 
| < |  Less than | 
| >= |  Greater than or equal | 
| <= |  Less than or equal | 
| BETWEEN |  Between an inclusive range | 
| LIKE |  Search for a pattern | 
| IN | If you know the exact value you want to return for at least one of the columns |

**Note:** In some versions of SQL the <> operator may be written as !=

**The AND & OR Operators**

- The AND & OR operators are used to filter records based on more than one condition.

- The AND operator displays a record if both the first condition and the second condition is true.
     
- The OR operator displays a record if either the first condition or the second condition is true.

**AND Operator Example**

Now we want to select only the persons with the first name equal to "Tove" AND the last name equal to
"Svendson":

We use the following SELECT statement:

```sql
SELECT * FROM Persons
WHERE FirstName='Tove'AND LastName='Svendson'
```

The result-set will look like this:

| P_Id|  LastName|  FirstName|  Address|  City| 
| :- | :- | :- | :- | :- |
| 2 | Svendson|   Tove |  Borgvn 23|  Stavanger|

**OR Operator Example**
We use the following SELECT statement:

```sql
SELECT * FROM Persons
WHERE FirstName='Tove' OR FirstName='Ola'
```

**Combining AND & OR**

You can also combine AND and OR (use parenthesis to form complex expressions).

```sql
SELECT * FROM Persons 
WHERE LastName='Svendson' AND (FirstName='Tove' OR FirstName='Ola')
```

**The ORDER BY Keyword**

- The ORDER BY keyword is used to sort the result-set.
- The ORDER BY keyword is used to sort the result-set by a specified column.
- The ORDER BY keyword sort the records in ascending order by default.
- If you want to sort the records in a descending order, you can use the DESC keyword.
- SQL ORDER BY Synta-

```sql
SELECT column_name(s)
FROM table_name ORDER BY column_name(s) ASC|DESC
```

**ORDER BY DESC Example**

```sql
SELECT * FROM Persons ORDER BY LastName DESC
```

Now we want to select all the persons from the table above, however, we want to sort the persons
descending by their last name

The result-set will look like this:

| P_Id|  LastName|  FirstName|  Address|  City|
| :- | :- | :- | :- |:- |
| 2|  Svendson|  Tove | Borgvn 23|  Sandnes| 
| 3|  Pettersen|  Kari | Storgt 20|  Stavanger| 
| 4 | Nilsen | Tom | Vingvn 23|  Stavanger| 
| 1|  Hansen | Ola | Timoteivn 10|  Sandnes|

**The INSERT INTO Statement**

- The INSERT INTO statement is used to insert new records in a table.
- The INSERT INTO statement is used to insert a new row in a table.
- SQL INSERT INTO Syntax
- It is possible to write the INSERT INTO statement in two forms.
- The first form doesn't specify the column names where the data will be inserted, only their values:-
  ```sql
  INSERT INTO table_name VALUES (value1, value2, value3,...)
  ```
- The second form specifies both the column names and the values to be inserted:
  ```sql
  INSERT INTO table_name (column1, column2, column3,...) VALUES (value1, value2,
value3,...)
```

**The UPDATE Statement**

- The UPDATE statement is used to update records in a table.
- The UPDATE statement is used to update existing records in a table.
- SQL UPDATE Syntax

```sql
    UPDATE table_name 
    SET column1=value, column2=value2,... 
    WHERE some_column=some_value
```
**Note:** Notice the WHERE clause in the UPDATE syntax. The WHERE clause specifies which record or
records that should be updated. If you omit the WHERE clause, all records will be updated!

**The DELETE Statement**

- The DELETE statement is used to delete records in a table.
- The DELETE statement is used to delete rows in a table.
- SQL DELETE Syntax
```sql
    DELETE FROM table_name
    WHERE some_column=some_value
```
**Note:** Notice the WHERE clause in the DELETE syntax. The WHERE clause specifies which record or
records that should be deleted. If you omit the WHERE clause, all records will be deleted-

**The SQL UNION Operator**

- The UNION operator is used to combine the result-set of two or more SELECT statements.
- Notice that each SELECT statement within the UNION must have the same number of columns.
The columns must also have similar data types. Also, the columns in each SELECT statement
must be in the same order.
- SQL UNION Syntax:
```sql
    SELECT column_name(s) FROM table_name1
    UNION
    SELECT column_name(s) FROM table_name2
```
**Note:** The UNION operator selects only distinct values by default. To allow duplicate values,
use UNION ALL-

- SQL UNION ALL Syntax:
```sql
    SELECT column_name(s) FROM table_name1
    UNION ALL
    SELECT column_name(s) FROM table_name2
```
- PS: The column names in the result-set of a UNION are always equal to the column names in the
first SELECT statement in the UNION.-

**The CREATE DATABASE Statement**

- The CREATE DATABASE statement is used to create a database.
- SQL CREATE DATABASE Syntax:
```sql
    CREATE DATABASE database_nam
```

**CREATE DATABASE Example:**
Now we want to create a database called "my_db".
    
We use the following CREATE DATABASE statement:

CREATE DATABASE my_db

Database tables can be added with the CREATE TABLE statement.
    
The CREATE TABLE Statement

The CREATE TABLE statement is used to create a table in a database.
    
SQL CREATE TABLE Syntax:
```sql
    CREATE TABLE table_name
    (
    column_name1 data_type,
    column_name2 data_type,
    column_name3 data_type,
    ....
    )
```

The data type specifies what type of data the column can hold. For a complete reference of all the data
types available in MS Access, MySQL, and SQL Server.

**● GROUP BY**

The GROUP BY clause in SQL is used to group rows from a table based on one or more
columns.